## Production: secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| update | `aws_secretsmanager_secret_version.freshdesk_api_key`            |
|        | `aws_secretsmanager_secret_version.notify_api_key`               |
|        | `aws_secretsmanager_secret_version.recaptcha_secret`             |
|        | `aws_secretsmanager_secret_version.token_secret`                 |
| add    | `aws_secretsmanager_secret.notify_callback_bearer_token`         |
|        | `aws_secretsmanager_secret_version.notify_callback_bearer_token` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_secretsmanager_secret.notify_callback_bearer_token will be created
  + resource "aws_secretsmanager_secret" "notify_callback_bearer_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "notify_callback_bearer_token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_secretsmanager_secret_version.freshdesk_api_key will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "freshdesk_api_key" {
        id             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:freshdesk_api_key-2Q118n|050422F2-B95D-45CF-83EC-7F5D7B1A59A2"
        # (5 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.notify_api_key will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "notify_api_key" {
        id             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:notify_api_key-sLtddr|EE73FE9C-4AE8-4807-8C62-583B67026995"
        # (5 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.notify_callback_bearer_token will be created
  + resource "aws_secretsmanager_secret_version" "notify_callback_bearer_token" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.recaptcha_secret will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "recaptcha_secret" {
        id             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:recaptcha_secret-LxfCjN|967811CC-0531-47D8-8EBB-989DA955784C"
        # (5 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.token_secret will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "token_secret" {
        id             = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:token_secret-jw4Dou|B98778D7-F936-4F7A-985E-CC38A5FA7213"
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  + notify_callback_bearer_token_secret_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.freshdesk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_callback_bearer_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.recaptcha_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.token_secret"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
